app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Bout"], ["created_at", "2016-10-21 20:35:33.690205"], ["updated_at", "2016-10-21 20:35:33.690205"]]