app/controllers/sessions_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."email" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["email", "blshapiro@uh.edu"]]
---
  def create

    if auth_hash = request.env["omniauth.auth"]
      user = User.find_or_create_by_omniauth(auth_hash)
      # oauth_email = request.env["omniauth.auth"][:info][:email]
      # if user = User.find_by(:email => oauth_email)
      #   session[:user_id] = user.id
      #   redirect_to root_path
      # else
      #   user = User.create(email: oauth_email, password: SecureRandom.hex)
      #   if user.save
      #     session[:user_id] = user.id
      #     redirect_to root_path
      #   else
      #     raise user.errors.full_messages.inspect
      #   end
      # end
      session[:user_id] = user.id
      redirect_to root_path
    else
      user = User.find_or_create_by(:email => params[:email])