app/controllers/users_controller.rb

  def create
    @user = User.new
    @user.email = params[:user][:email]

    @user.password = params[:user][:password]
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "benny"], ["password_digest", "$2a$10$JVKNSaeMBvFLNEKyYNqxx.d9tc7t6BA/OnnOMeyTjNi5mtnnlb.KC"], ["created_at", "2016-11-07 19:08:07.635358"], ["updated_at", "2016-11-07 19:08:07.635358"]]